tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "bat"
brew "eza"
brew "fd"
brew "fish"
brew "gh"
brew "git"
brew "jq"
brew "mas"
brew "python@3.12"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "stow"
brew "tmux"
brew "watchman"
brew "wget"
cask "1password"
cask "docker"
cask "font-inter"
cask "font-sf-mono"
cask "google-chrome"
cask "iterm2"
cask "visual-studio-code"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
vscode "bmalehorn.vscode-fish"
vscode "eamodio.gitlens"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "rust-lang.rust-analyzer"
vscode "vscodevim.vim"
